from pprint import pprint
data = {"區別":"大甲","店家":"勤惠素食自助餐","盒餐名稱":"素食餐盒1"},{"區別":"大甲","店家":"勤惠素食自助餐","盒餐名稱":"素食餐盒2"},{"區別":"大安","店家":"聯引餐盒廠","盒餐名稱":"香烤雞翅餐盒"},{"區別":"大安","店家":"聯引餐盒廠","盒餐名稱":"香烤雞排餐盒"},{"區別":"大安","店家":"聯引餐盒廠","盒餐名稱":"香滷雞腿餐盒"},{"區別":"大肚","店家":"阿振自助餐","盒餐名稱":"五穀海鮮健康餐"},{"區別":"大肚","店家":"阿蓮自助餐","盒餐名稱":"五穀鱈魚健康餐"},{"區別":"大里","店家":"瑞安餐盒食品工廠","盒餐名稱":"薑燒豬肉"},{"區別":"大里","店家":"香豪佳食品有限公司","盒餐名稱":"芝麻烤雞腿便當"},{"區別":"大雅","店家":"勝騏食品工廠有限公司","盒餐名稱":"均衡高纖健康套餐雞排"},{"區別":"大雅","店家":"勝騏食品工廠有限公司","盒餐名稱":"均衡高纖健康套餐豬排"},{"區別":"中西","店家":"中興素食-林森店","盒餐名稱":"健康餐"},{"區別":"中西","店家":"親子園食堂-美村店","盒餐名稱":"蒜泥白肉"},{"區別":"中西","店家":"蓮香素食","盒餐名稱":"蓮香健康餐"},{"區別":"太平","店家":"雙慧素食","盒餐名稱":"健康素食便當"},{"區別":"太平","店家":"臺灣楓康超市東平店","盒餐名稱":"美味健康餐"},{"區別":"太平","店家":"臺灣楓康超市東平店","盒餐名稱":"輕盈窈窕健康餐"},{"區別":"北屯","店家":"大采廚房天津店","盒餐名稱":"嫩煎豬排"},{"區別":"北屯","店家":"悟饕池上飯包松竹店","盒餐名稱":"養生飯包"},{"區別":"北屯","店家":"荳桑中式便當店","盒餐名稱":"鯖魚養生五榖盒餐"},{"區別":"北屯","店家":"荳桑中式便當店","盒餐名稱":"五色養生五榖盒餐"},{"區別":"北區","店家":"御館複合式餐飲","盒餐名稱":"魯雞腿飯"},{"區別":"北區","店家":"周家飯館","盒餐名稱":"腳庫便當"},{"區別":"外埔","店家":"吉米食品有限公司","盒餐名稱":"健康盒餐-雞翅飯"},{"區別":"外埔","店家":"吉米食品有限公司","盒餐名稱":"健康盒餐-鯛魚飯"},{"區別":"石岡","店家":"石岡傳統美食小鋪","盒餐名稱":"白斬雙拼"},{"區別":"石岡","店家":"福祥自助餐","盒餐名稱":"雞腿飯"},{"區別":"后里","店家":"慈緣健康素食館","盒餐名稱":"素食便當1"},{"區別":"后里","店家":"慈緣健康素食館","盒餐名稱":"素食便當2"},{"區別":"西屯","店家":"金豪臺灣小吃","盒餐名稱":"無骨油雞飯"},{"區別":"西屯","店家":"新羅韓國料理","盒餐名稱":"銅板烤肉飯"},{"區別":"沙鹿","店家":"淇津自助快餐","盒餐名稱":"油雞便當"},{"區別":"沙鹿","店家":"淇津自助快餐","盒餐名稱":"雞腿飯"},{"區別":"沙鹿","店家":"楓康超市沙鹿店","盒餐名稱":"素食便當"},{"區別":"沙鹿","店家":"楓康超市沙鹿店","盒餐名稱":"鯖魚便當"},{"區別":"和平","店家":"統一渡假村","盒餐名稱":"養身套餐"},{"區別":"和平","店家":"谷野溫泉會館","盒餐名稱":"健康養生餐"},{"區別":"東勢","店家":"悟饕池上飯包東勢店","盒餐名稱":"養生盒餐"},{"區別":"東勢","店家":"蓮華素食自助餐","盒餐名稱":"健康盒餐"},{"區別":"南屯","店家":"悟饕池上飯包向心店","盒餐名稱":"養生飯包"},{"區別":"南屯","店家":"豪菩提素食館","盒餐名稱":"健康營養餐盒"},{"區別":"南區","店家":"九興蔬齋館","盒餐名稱":"經濟特餐"},{"區別":"南區","店家":"善元齋素食自助餐","盒餐名稱":"素鰻魚便當"},{"區別":"烏日","店家":"華香美食坊","盒餐名稱":"雞腿便當"},{"區別":"烏日","店家":"悟饕池上飯包明道店","盒餐名稱":"養生飯包"},{"區別":"神岡","店家":"巧成自助餐","盒餐名稱":"虱目魚飯"},{"區別":"神岡","店家":"樂活健康素食園","盒餐名稱":"樂活素食便當"},{"區別":"梧棲","店家":"豐味素食館","盒餐名稱":"健康盒餐季節時蔬 "},{"區別":"梧棲","店家":"紅葉現炒","盒餐名稱":"蒜泥白肉便當"},{"區別":"梧棲","店家":"富鑫自助餐","盒餐名稱":"迷迭香烤雞腿排便當"},{"區別":"清水","店家":"佳祥餐盒食品廠","盒餐名稱":"京醬排骨便當"},{"區別":"清水","店家":"台邑餐飲有限公司","盒餐名稱":"高纖雞腿便當"},{"區別":"新社","店家":"櫻花鳥森林之問月餐廳","盒餐名稱":"養生套餐1"},{"區別":"新社","店家":"櫻花鳥森林之問月餐廳","盒餐名稱":"養生套餐2"},{"區別":"潭子","店家":"中興素食自助餐雅潭店","盒餐名稱":"每日蔬食特餐"},{"區別":"潭子","店家":"天慈素食潭子店","盒餐名稱":"養生蔬食便當1"},{"區別":"潭子","店家":"天慈素食潭子店","盒餐名稱":"養生蔬食便當2"},{"區別":"龍井","店家":"廣達素食自助餐","盒餐名稱":"素食便當"},{"區別":"龍井","店家":"泳旭自然生活館","盒餐名稱":"健康五穀餐"},{"區別":"豐原","店家":"悟饕池上飯包向陽店","盒餐名稱":"正宗池上飯包"},{"區別":"豐原","店家":"東坡自助餐","盒餐名稱":"滷雞腿便當"},{"區別":"豐原","店家":"水煮館","盒餐名稱":"原味雞腿排"},{"區別":"霧峰","店家":"佛有緣素食館","盒餐名稱":"健康素食便當"},{"區別":"霧峰","店家":"悟饕池上飯包飯友飲食店","盒餐名稱":"養生飯包"}

# 每個區域的便當店數量
area = {}

for i in data:
    ar = i['區別']
    if ar in list(area.keys()):
        area[ar] += 1
    else:
        area[ar] = 1
sorteddarea = sorted(area.items(), key=lambda x : x[1])
pprint(sorteddarea)

#素食跟葷食店家數量
Store = {'素食':0,'葷食':0}
for i in data:
    St = i['店家']
    if St.find('素食') != -1:
        Store['素食'] += 1
    else:
        Store['葷食'] += 1
sorted_store = sorted(Store.items(), key=lambda x : x[1])
print("\n")
pprint( "{}".format(sorted_store))