Pokemon = {1:("001","妙蛙種子","0.7","6.9","茂盛","草、毒"),2:("002","妙蛙草","1.0","13.0","茂盛","草、毒"),3:("003","妙蛙花","2.0","100.0","茂盛","草、毒"),4:("004","小火龍","0.6","8.5","猛火","火"),5:("005","火恐龍","1.1","19.0","猛火","火"),6:("006","噴火龍","1.7","90.5","猛火","火、飛行"),7:("007","傑尼龜","0.5","9.0","激流","水"),8:("008","卡咪龜","1.0","22.5","激流","水"),9:("009","水箭龜","1.6","85.5","激流","水"),25:("025","皮卡丘","0.4","6.0","靜電","電"),26:("026","雷丘","0.8","30.0","靜電","電"),152:("152","菊草葉","0.9","6.4","茂盛","草"),153:("153","月桂葉","1.2","15.8","茂盛","草"),154:("154","大竺葵","1.8","100.5","茂盛","草"),155:("155","火球鼠","0.5","7.9","猛火","火"),156:("156","火岩鼠","0.9","19.0","猛火","火"),157:("157","火爆獸","1.7","79.5","猛火","火"),158:("158","小鋸鱷","0.6","9.5","激流","水"),159:("159","藍鱷","1.1","25.0","激流","水"),160:("160","大力鱷","2.3","88.8","激流","水"),252:("252","木守宮","0.5","5.0","茂盛","草"),253:("253","森林蜥蜴","0.9","21.6","茂盛","草"),254:("254","蜥蜴王","1.7","52.2","茂盛","草"),255:("255","火稚雞","0.4","2.5","猛火","火"),256:("256","力壯雞","0.9","19.5","猛火","火、格鬥"),257:("257","火焰雞","1.9","52.0","猛火","火、格鬥"),258:("258","水躍魚","0.4","7.6","激流","水"),259:("259","沼躍魚","0.7","28.0","激流","水、地面"),260:("260","巨沼怪","1.5","81.9","激流","水、地面")}
chose = 1
ALL = list(Pokemon.values())
while(1):
    chose = int(input("(1): 查看所有神奇寶貝資訊\n"+"(2): 依據身高排序所有神奇寶貝"+"\n(3): 列出所有草系神奇寶貝:"+"\n(4): 列出所有火系神奇寶貝:"+"\n(5): 列出所有水系神奇寶貝:"+"\n(6): 列出所有雷系神奇寶貝:"+"\n(7): 離開圖鑑\n\n"))
    if chose == 1:
        for i in ALL:
            print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+" 身高:{}\t".format(i[2])+" 體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 2:
        Sort = sorted(ALL, key=lambda x : x[2])
        for i in Sort:
            print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+" 身高:{}\t".format(i[2])+" 體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 3:
        for i in ALL:
            if i[5].find("草") != -1:
                print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+" 身高:{}\t".format(i[2])+" 體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 4:
        for i in ALL:
            if i[5].find("火") != -1:
                print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+" 身高:{}\t".format(i[2])+" 體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 5:
        for i in ALL:
            if i[5].find("水") != -1:
                print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+"身高:{}\t".format(i[2])+"體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 6:
        for i in ALL:
            if i[5].find("電") != -1:
                print("編號:{}\t".format(i[0])+" 名稱:{}\t".format(i[1])+" 身高:{}\t".format(i[2])+" 體重:{}\t".format(i[3])+"特性:{}\t".format(i[4])+"屬性:{}\n".format(i[5]))
    elif chose == 7:
        print("\n\n歡迎再次使用本圖鑑 謝謝!")
        break;
    else:
        print("無此選項 請再次輸入選項 謝謝\n")